package org.mo.com.message;

//============================================================
// <T>调试消息。</T>
//============================================================
public class FDebugMessage
      extends FAbstractMessage
{
   // 名称
   protected static String NAME = "Info";

   //============================================================
   // <T>构造调试消息。</T>
   //============================================================
   public FDebugMessage(){
   }

   //============================================================
   // <T>构造调试消息。</T>
   //
   // @param message 消息
   //============================================================
   public FDebugMessage(String message){
      super(message);
   }

   //============================================================
   // <T>构造调试消息。</T>
   //
   // @param message 消息
   // @param params 参数集合
   //============================================================
   public FDebugMessage(String message,
                        String... params){
      super(message, params);
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================
   @Override
   public String name(){
      return NAME;
   }
}
