package org.mo.com.message;

//============================================================
// <T>错误消息。</T>
//============================================================
public class FErrorMessage
      extends FAbstractMessage
{
   // 名称
   protected static String NAME = "Error";

   //============================================================
   // <T>构造错误消息。</T>
   //============================================================
   public FErrorMessage(){
   }

   //============================================================
   // <T>构造错误消息。</T>
   //
   // @param message 消息
   //============================================================
   public FErrorMessage(String message){
      super(message);
   }

   //============================================================
   // <T>构造错误消息。</T>
   //
   // @param message 消息
   // @param params 参数集合
   //============================================================
   public FErrorMessage(String message,
                        Object... params){
      super(message, params);
   }

   //============================================================
   // <T>构造错误消息。</T>
   //============================================================
   public FErrorMessage(Throwable throwable){
      super(throwable);
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================
   @Override
   public String name(){
      return NAME;
   }
}
