package org.mo.com.message;

//============================================================
// <T>检查消息。</T>
//============================================================
public class FValidMessage
      extends FAbstractMessage
{
   // 名称
   protected static String NAME = "Valid";

   //============================================================
   // <T>构造检查消息。</T>
   //============================================================
   public FValidMessage(){
   }

   //============================================================
   // <T>构造检查消息。</T>
   //
   // @param message 消息
   //============================================================
   public FValidMessage(String message){
      super(message);
   }

   //============================================================
   // <T>构造检查消息。</T>
   //
   // @param message 消息
   // @param params 参数集合
   //============================================================
   public FValidMessage(String message,
                        String... params){
      super(message, params);
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================
   @Override
   public String name(){
      return NAME;
   }
}
