package com.ahyc.eai.batch.statistics.financial.department;

import org.mo.com.lang.FObject;
import org.mo.com.lang.FObjects;

//============================================================
// <T>部门信息。</T>
//============================================================
public class FStatisticsDepartmentInfo
      extends FObject
{
   // 编号
   protected long _id;

   // 标签
   protected String _label;

   // 编号集合
   protected String _ids;

   // 标签集合
   protected String _labels;

   protected FObjects<SDepartmentInfo> _levels = new FObjects<SDepartmentInfo>(SDepartmentInfo.class);

   //============================================================
   // <T>获得编号。</T>
   //============================================================
   public long id(){
      return _id;
   }

   //============================================================
   // <T>设置编号。</T>
   //============================================================
   public void setId(long id){
      this._id = id;
   }

   //============================================================
   // <T>获得标签。</T>
   //============================================================
   public String label(){
      return _label;
   }

   //============================================================
   // <T>设置标签。</T>
   //============================================================
   public void setLabel(String label){
      this._label = label;
   }

   //============================================================
   // <T>获得编号集合。</T>
   //============================================================
   public String ids(){
      return _ids;
   }

   //============================================================
   // <T>设置编号集合。</T>
   //============================================================
   public void setIds(String ids){
      this._ids = ids;
   }

   //============================================================
   // <T>获得标签集合。</T>
   //============================================================
   public String labels(){
      return _labels;
   }

   //============================================================
   // <T>设置标签集合。</T>
   //============================================================
   public void setLabels(String labels){
      this._labels = labels;
   }

   //============================================================
   // <T>获得层级集合。</T>
   //============================================================
   public FObjects<SDepartmentInfo> levels(){
      return _levels;
   }
}
