package org.mo.mime.zip;

import org.mo.com.lang.FObject;

//============================================================
// <T>ZIP压缩流。</T>
//============================================================
public class FZipStream
      extends FObject
{
   // 当前入口
   protected FZipEntry _entry;

   // 入口集合
   protected FZipEntries _entries = new FZipEntries();

   //============================================================
   // <T>构造ZIP压缩流。</T>
   //============================================================
   public FZipStream(){
   }

   //============================================================
   // <T>获得当前入口。</T>
   //
   // @return 当前入口
   //============================================================
   public FZipEntry currentEntry(){
      return _entry;
   }

   //============================================================
   // <T>获得当前入口集合。</T>
   //
   // @return 当前入口集合
   //============================================================
   public FZipEntries entries(){
      return _entries;
   }
}
