package org.mo.script.java.parser;

import org.mo.com.lang.FObject;
import org.mo.com.xml.FXmlNode;

//============================================================
// <T>基础对象。</T>
//============================================================
public class FJavaObject
      extends FObject
{
   // 名称
   protected String _name;

   // 标签
   protected String _label;

   //============================================================
   // <T>构造基础对象。</T>
   //============================================================
   public FJavaObject(){
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================
   public String name(){
      return _name;
   }

   //============================================================
   // <T>设置名称。</T>
   //
   // @param name 名称
   //============================================================
   public void setName(String name){
      _name = name.trim();
   }

   //============================================================
   // <T>获得标签。</T>
   //
   // @return 标签
   //============================================================
   public String label(){
      return _label;
   }

   //============================================================
   // <T>设置标签。</T>
   //
   // @param label 标签
   //============================================================
   public void setLabel(String label){
      _label = label;
   }

   //============================================================
   // <T>保存设置信息。</T>
   //
   // @param xconfig 设置节点
   //============================================================
   public void saveConfig(FXmlNode xconfig){
      xconfig.set("name", _name);
      xconfig.set("label", _label);
   }
}
