package com.cyou.gccloud.service.common.entity;

import org.mo.com.xml.FXmlNode;

public class SMemoryPoolObject
{

   //============================================================
   // <T>接收对象内容。</T>
   //
   // @param object 对象
   //============================================================
   public void assign(Object object){
   }

   //============================================================
   // <T>序列化到输入流中。</T>
   //
   // @param output 输入流
   //============================================================
   public void saveConfig(FXmlNode xconfig){
   }

   //============================================================
   // <T>从输出流中反序列化。</T>
   //
   // @param input 输出流
   //============================================================
   public boolean loadConfig(FXmlNode xconfig){
      return true;
   }

   //============================================================
   // <T>重置内容。</T>
   //============================================================
   public void reset(){
   }

}
