package org.mo.eng.sms;

import org.mo.com.lang.FObject;

//============================================================
// <T>短信内容。</T>
//============================================================
public class FSms
      extends FObject
{
   public static final int DEBUG_CD_NONE = 0;

   public static final int DEBUG_CD_TEST = 1000;

   // 号码
   private String _code;

   // 内容
   private String _note;

   //============================================================
   // <T>构造短信内容。</T>
   //============================================================
   public FSms(){
   }

   //============================================================
   // <T>获得代码。</T>
   //
   // @return 代码
   //============================================================
   public String code(){
      return _code;
   }

   //============================================================
   // <T>设置代码。</T>
   //
   // @param code 代码
   //============================================================
   public void setCode(String code){
      _code = code;
   }

   //============================================================
   // <T>获得内容。</T>
   //
   // @return 内容
   //============================================================
   public String note(){
      return _note;
   }

   //============================================================
   // <T>设置内容。</T>
   //
   // @param note 内容
   //============================================================
   public void setNote(String note){
      _note = note;
   }
}
