package com.cyou.gccloud.core.logger;

import org.mo.com.lang.EResult;

//============================================================
// <T>日志控制台接口。</T>
//============================================================
public interface IGcLoggerConsole
{
   //============================================================
   // <T>获得服务代码。</T>
   //
   // @return 服务代码
   //============================================================
   String serverCode();

   //============================================================
   // <T>增加一个日志。</T>
   //
   // @param logger 日志对象
   // @return 处理结果
   //============================================================
   EResult push(FGcLogger logger);
}
