package org.mo.com.geom;

//============================================================
// <T>三维双浮点轮廓。</T>
//============================================================
public class SDoubleOutline3
{
   // 最小顶点
   public SDoublePoint3 min = new SDoublePoint3();

   // 最大顶点
   public SDoublePoint3 max = new SDoublePoint3();

   //============================================================
   // <T>构造三维双浮点轮廓。</T>
   //============================================================
   public SDoubleOutline3(){
   }

   //============================================================
   // <T>重置处理。</T>
   //============================================================
   public void reset(){
      min.max();
      max.min();
   }

   //============================================================
   // <T>获得内容字符串。</T>
   //
   // @return 字符串
   //============================================================
   @Override
   public String toString(){
      return min + "-" + max;
   }
}
