package org.mo.cloud.editor.core.message.common;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>校验功能对象的XML节点基类。</T>
//============================================================
public interface XValidationFace
      extends
         IXmlObject
{
   // 名称定义
   String NAME = "IValidation";

   // 非空检查的名称定义
   String PTY_VALID_EMPTY = "valid_empty";

   // 最小长度检查的名称定义
   String PTY_VALID_LENGTH_MIN = "valid_length_min";

   // 最大长度检查的名称定义
   String PTY_VALID_LENGTH_MAX = "valid_length_max";

   // 最小值检查的名称定义
   String PTY_VALID_VALUE_MIN = "valid_value_min";

   // 最大值检查的名称定义
   String PTY_VALID_VALUE_MAX = "valid_value_max";

   // 最小长度包含检查的名称定义
   String PTY_VALID_LENGTH_MIN_EQ = "valid_length_min_eq";

   // 最大长度包含检查的名称定义
   String PTY_VALID_LENGTH_MAX_EQ = "valid_length_max_eq";

   // 有效格式检查的名称定义
   String PTY_VALID_FORMAT_VALID = "valid_format_valid";

   // 无效格式检查的名称定义
   String PTY_VALID_FORMAT_INVALID = "valid_format_invalid";

   // 时间日期检查的名称定义
   String PTY_VALID_DATETIME = "valid_datetime";

   // 日期检查的名称定义
   String PTY_VALID_DATE = "valid_date";

   // 时间检查的名称定义
   String PTY_VALID_TIME = "valid_time";

   // 特殊检查的名称定义
   String PTY_VALID_SPECIAL = "valid_special";

   //============================================================
   // <T>获得非空检查的内容。</T>
   //
   // @return 非空检查
   //============================================================
   String getValidEmpty();

   //============================================================
   // <T>设置非空检查的内容。</T>
   //
   // @param value 非空检查
   //============================================================
   void setValidEmpty(String value);

   //============================================================
   // <T>获得最小长度检查的内容。</T>
   //
   // @return 最小长度检查
   //============================================================
   Boolean getValidLengthMin();

   //============================================================
   // <T>设置最小长度检查的内容。</T>
   //
   // @param value 最小长度检查
   //============================================================
   void setValidLengthMin(Boolean value);

   //============================================================
   // <T>获得最大长度检查的内容。</T>
   //
   // @return 最大长度检查
   //============================================================
   public String getValidLengthMax();

   //============================================================
   // <T>设置最大长度检查的内容。</T>
   //
   // @param value 最大长度检查
   //============================================================
   void setValidLengthMax(String value);

   //============================================================
   // <T>获得最小值检查的内容。</T>
   //
   // @return 最小值检查
   //============================================================
   String getValidValueMin();

   //============================================================
   // <T>设置最小值检查的内容。</T>
   //
   // @param value 最小值检查
   //============================================================
   void setValidValueMin(String value);

   //============================================================
   // <T>获得最大值检查的内容。</T>
   //
   // @return 最大值检查
   //============================================================
   String getValidValueMax();

   //============================================================
   // <T>设置最大值检查的内容。</T>
   //
   // @param value 最大值检查
   //============================================================
   void setValidValueMax(String value);

   //============================================================
   // <T>获得最小长度包含检查的内容。</T>
   //
   // @return 最小长度包含检查
   //============================================================
   String getValidLengthMinEq();

   //============================================================
   // <T>设置最小长度包含检查的内容。</T>
   //
   // @param value 最小长度包含检查
   //============================================================
   void setValidLengthMinEq(String value);

   //============================================================
   // <T>获得最大长度包含检查的内容。</T>
   //
   // @return 最大长度包含检查
   //============================================================
   String getValidLengthMaxEq();

   //============================================================
   // <T>设置最大长度包含检查的内容。</T>
   //
   // @param value 最大长度包含检查
   //============================================================
   void setValidLengthMaxEq(String value);

   //============================================================
   // <T>获得有效格式检查的内容。</T>
   //
   // @return 有效格式检查
   //============================================================
   String getValidFormatValid();

   //============================================================
   // <T>设置有效格式检查的内容。</T>
   //
   // @param value 有效格式检查
   //============================================================
   void setValidFormatValid(String value);

   //============================================================
   // <T>获得无效格式检查的内容。</T>
   //
   // @return 无效格式检查
   //============================================================
   String getValidFormatInvalid();

   //============================================================
   // <T>设置无效格式检查的内容。</T>
   //
   // @param value 无效格式检查
   //============================================================
   void setValidFormatInvalid(String value);

   //============================================================
   // <T>获得时间日期检查的内容。</T>
   //
   // @return 时间日期检查
   //============================================================
   String getValidDatetime();

   //============================================================
   // <T>设置时间日期检查的内容。</T>
   //
   // @param value 时间日期检查
   //============================================================
   void setValidDatetime(String value);

   //============================================================
   // <T>获得日期检查的内容。</T>
   //
   // @return 日期检查
   //============================================================
   String getValidDate();

   //============================================================
   // <T>设置日期检查的内容。</T>
   //
   // @param value 日期检查
   //============================================================
   void setValidDate(String value);

   //============================================================
   // <T>获得时间检查的内容。</T>
   //
   // @return 时间检查
   //============================================================
   String getValidTime();

   //============================================================
   // <T>设置时间检查的内容。</T>
   //
   // @param value 时间检查
   //============================================================
   void setValidTime(String value);

   //============================================================
   // <T>获得特殊检查的内容。</T>
   //
   // @return 特殊检查
   //============================================================
   String getValidSpecial();

   //============================================================
   // <T>设置特殊检查的内容。</T>
   //
   // @param value 特殊检查
   //============================================================
   void setValidSpecial(String value);
}
