package org.mo.eai.console.financial;

import org.mo.com.lang.FObject;

//============================================================
// <T>理财师信息。</T>
//============================================================
public class FFinancialMarketerInfo
      extends FObject
{

   //外链用户编号
   private long _linkId;

   //名称
   private String _name;

   // 登录名
   private String _passport;

   // 标签
   private String _label;

   // 手机
   private String _phone;

   // 身份证
   private String _card;

   //============================================================
   // <T>获取外链用户编号。</T>
   //
   // @return 
   //============================================================
   public long linkId(){
      return _linkId;
   }

   //============================================================
   // <T>设置外链用户编号。</T>
   //
   // @return 
   //============================================================
   public void setLinkId(long _linkId){
      this._linkId = _linkId;
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================
   public String name(){
      return _name;
   }

   //============================================================
   // <T>设置名称。</T>
   //
   // @return 名称
   //============================================================
   public void setName(String _name){
      this._name = _name;
   }

   //============================================================
   // <T>获得登录名。</T>
   //
   // @return 登录名
   //============================================================
   public String passport(){
      return _passport;
   }

   //============================================================
   // <T>设置登录名。</T>
   //
   // @param passport 登录名
   //============================================================
   public void setPassport(String passport){
      _passport = passport;
   }

   //============================================================
   // <T>获得标签。</T>
   //
   // @return 标签
   //============================================================
   public String label(){
      return _label;
   }

   //============================================================
   // <T>设置标签。</T>
   //
   // @param label 标签
   //============================================================
   public void setLabel(String label){
      _label = label;
   }

   //============================================================
   // <T>获得手机。</T>
   //
   // @return 手机
   //============================================================
   public String phone(){
      return _phone;
   }

   //============================================================
   // <T>设置手机。</T>
   //
   // @param phone 手机
   //============================================================
   public void setPhone(String phone){
      _phone = phone;
   }

   //============================================================
   // <T>获得身份证。</T>
   //
   // @return 身份证
   //============================================================
   public String card(){
      return _card;
   }

   //============================================================
   // <T>设置身份证。</T>
   //
   // @param label 身份证
   //============================================================
   public void setCard(String card){
      _card = card;
   }
}
