package org.mo.data.logic;

import org.mo.com.lang.EResult;

//============================================================
// <T>逻辑数据表接口。</T>
//============================================================
public interface ILogicTable
{
   //============================================================
   // <T>准备一个数据单元。</T>
   //
   // @param logicUnit 数据单元
   // @return 处理结果
   //============================================================
   EResult doPrepare(FLogicUnit logicUnit);

   //============================================================
   // <T>插入一个数据单元。</T>
   //
   // @param unit 数据单元
   // @return 处理结果
   //============================================================
   EResult doInsert(FLogicUnit unit);

   //============================================================
   // <T>更新一个数据单元。</T>
   //
   // @param logicUnit 数据单元
   // @return 处理结果
   //============================================================
   EResult doUpdate(FLogicUnit logicUnit);

   //============================================================
   // <T>更新一个数据单元。</T>
   //
   // @param unit 数据单元
   // @param recordId 记录编号
   // @return 处理结果
   //============================================================
   EResult doUpdate(FLogicUnit unit,
                    long recordId);

   //============================================================
   // <T>删除一个数据单元。</T>
   //
   // @param recordId 记录编号
   // @return 处理结果
   //============================================================
   EResult doDelete(long recordId);

   //============================================================
   // <T>删除一个数据单元。</T>
   //
   // @param logicUnit 数据单元
   // @return 处理结果
   //============================================================
   EResult doDelete(FLogicUnit logicUnit);

   //============================================================
   // <T>删除一个数据单元。</T>
   //
   // @param logicUnit 数据单元
   // @param recordId 记录编号
   // @return 处理结果
   //============================================================
   EResult doDelete(FLogicUnit logicUnit,
                    long recordId);

   //============================================================
   // <T>清除所有数据单元。</T>
   //
   // @return 处理结果
   //============================================================
   EResult doClear();
}
