package org.mo.data.logic;

//============================================================
// <T>逻辑表描述。</T>
//============================================================
public class SLogicTableInfo
{
   // 逻辑名称
   protected String _logicName;

   // 名称
   protected String _name;

   //============================================================
   // <T>构造逻辑表。</T>
   //============================================================
   public SLogicTableInfo(){
   }

   //============================================================
   // <T>构造逻辑表。</T>
   //
   // @param name 字段名称
   //============================================================
   public SLogicTableInfo(String logicName,
                          String name){
      _logicName = logicName;
      _name = name;
   }

   //============================================================
   // <T>获得逻辑名称。</T>
   //
   // @return 逻辑名称
   //============================================================
   public String logicName(){
      return _logicName;
   }

   //============================================================
   // <T>设置逻辑名称。</T>
   //
   // @param logicName 逻辑名称
   //============================================================
   public void setLogicName(String logicName){
      _logicName = logicName;
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================
   public String name(){
      return _name;
   }

   //============================================================
   // <T>获得小写名称。</T>
   //
   // @return 小写名称
   //============================================================
   public String lowerName(){
      return _name.toLowerCase();
   }

   //============================================================
   // <T>设置名称。</T>
   //
   // @param name 名称
   //============================================================
   public void setName(String name){
      _name = name;
   }

   //============================================================
   // <T>获得字符串。</T>
   //
   // @return 字符串
   //============================================================
   @Override
   public String toString(){
      return _name;
   }
}
