package org.mo.data.logic.cache;

//============================================================
// <T>逻辑单元缓冲控制台接口。</T>
//============================================================
public interface ILogicUnitCacheConsole
{
   //============================================================
   // <T>收集逻辑单元缓冲频道。</T>
   //
   // @return 内存频道
   //============================================================
   FLogicUnitCacheChannel alloc();

   //============================================================
   // <T>释放逻辑单元缓冲频道。</T>
   //
   // @param channel 内存频道
   //============================================================
   void free(FLogicUnitCacheChannel channel);
}
