package org.mo.com.text.parser;

import org.mo.com.lang.FObject;
import org.mo.com.lang.RInteger;

//============================================================
// <T>文本行。</T>
//============================================================
public class FTextLine
      extends FObject
{
   // 行号
   protected int _lineNumber;

   // 来源
   protected String _source;

   // 文本
   protected String _text;

   //============================================================
   // <T>文本行。</T>
   //============================================================
   public FTextLine(){
   }

   //============================================================
   // <T>获得行号。</T>
   //
   // @return 行号
   //============================================================
   public int lineNumber(){
      return _lineNumber;
   }

   //============================================================
   // <T>设置行号。</T>
   //
   // @param lineNumber 行号
   //============================================================
   public void setLineNumber(int lineNumber){
      _lineNumber = lineNumber;
   }

   //============================================================
   // <T>获得来源。</T>
   //
   // @return 来源
   //============================================================
   public String source(){
      return _source;
   }

   //============================================================
   // <T>设置来源。</T>
   //
   // @param source 来源
   //============================================================
   public void setSource(String source){
      _source = source;
   }

   //============================================================
   // <T>获得文本。</T>
   //
   // @return 文本
   //============================================================
   public String text(){
      return _text;
   }

   //============================================================
   // <T>设置文本。</T>
   //
   // @param text 文本
   //============================================================
   public void setText(String text){
      _text = text;
   }

   //============================================================
   // <T>加载数据。</T>
   //
   // @param lineNumber 行号
   // @param line 行文本
   //============================================================
   public void load(int lineNumber,
                    String line){
      _lineNumber = lineNumber;
      _source = line;
      _text = line.trim();
   }

   //============================================================
   // <T>获得字符串。</T>
   //
   // @return 字符串
   //============================================================
   @Override
   public String toString(){
      return RInteger.format(_lineNumber, 4) + " - " + _source + " [" + _text + "]";
   }
}
