package org.mo.eng.data;

import org.mo.com.lang.FObject;

//============================================================
// <T>数据操作者。</T>
//============================================================
public class FDataOperator
      extends FObject
{
   // 用户编号
   protected long _userId;

   //============================================================
   // <T>获得用户编号。</T>
   //
   // @return 用户编号
   //============================================================
   public long userId(){
      return _userId;
   }

   //============================================================
   // <T>设置用户编号。</T>
   //
   // @param userId 用户编号
   //============================================================
   public void setUserId(long userId){
      _userId = userId;
   }
}
