package org.mo.cloud.core.storage;

//============================================================
// <T>存储控制台接口。</T>
//============================================================
public interface IGcStorageConsole
{
   //   //============================================================
   //   // <T>获得服务器地址。</T>
   //   //
   //   // @return 服务器地址
   //   //============================================================
   //   String storageServer();
   //
   //   //============================================================
   //   // <T>获得服务器资源地址。</T>
   //   //
   //   // @return 服务器资源地址
   //   //============================================================
   //   String storageResource();
   //
   //   //============================================================
   //   // <T>获得存储临时路径。</T>
   //   //
   //   // @return 存储临时路径
   //   //============================================================
   //   String storageTemp();
   //
   //   //============================================================
   //   // <T>生成文本。</T>
   //   //
   //   // @param text 文本
   //   // @return 文本
   //   //============================================================
   //   String makeText(String text);
   //
   //   //============================================================
   //   // <T>生成显示文本。</T>
   //   //
   //   // @param text 文本
   //   // @return 文本
   //   //============================================================
   //   String makeDisplay(String text);

   //============================================================
   // <T>生成网络地址。</T>
   //
   // @param pack 打包字符串
   // @return 网络地址
   //============================================================
   String makeUrl(String pack);

   //============================================================
   // <T>生成网络地址。</T>
   //
   // @param storage 存储信息
   // @return 网络地址
   //============================================================
   String makeUrl(SGcStorage storage);

   //   //============================================================
   //   // <T>生成图片网络图片地址。</T>
   //   //
   //   // @param deviceCd 设备类型
   //   // @param qualityCd 品质类型
   //   // @param displayCd 显示类型
   //   // @return 网络图片地址
   //   //============================================================
   //   String makePictureUrl(String typeName,
   //                         String subTypeName,
   //                         int displayCd,
   //                         String uri);
   //
   //   //============================================================
   //   // <T>生成图片网络图片地址。</T>
   //   //
   //   // @param deviceCd 设备类型
   //   // @param qualityCd 品质类型
   //   // @param deviceCd 设备类型
   //   // @param qualityCd 质量类型
   //   // @param displayCd 显示类型
   //   // @return 网络图片地址
   //   //============================================================
   //   String makePictureUrl(String typeName,
   //                         String subTypeName,
   //                         int deviceCd,
   //                         int qualityCd,
   //                         int displayCd,
   //                         String uri);
   //
   //   //============================================================
   //   // <T>生成类型网络相对地址。</T>
   //   //
   //   // @param type 网络地址
   //   // @param uri 网络地址
   //   // @return 网络地址
   //   //============================================================
   //   String makeTypeUri(String type,
   //                      String uri);
   //
   //   //============================================================
   //   // <T>生成质量代码。</T>
   //   //
   //   // @param deviceCode 设备代码
   //   // @param width 文本
   //   // @param height 文本
   //   // @return 质量代码
   //   //============================================================
   //   String makeQualityCode(String deviceCode,
   //                          int width,
   //                          int height);
   //
   //   //============================================================
   //   // <T>校验一个存储信息。</T>
   //   //
   //   // @param storage 存储信息
   //   // @return 处理结果
   //   //============================================================
   //   boolean check(SGcStorage storage);
   //
   //============================================================
   // <T>保存一个存储信息。</T>
   //
   // @param storage 存储信息
   // @return 处理结果
   //============================================================
   boolean store(SGcStorage storage);

   //   //============================================================
   //   // <T>删除一个存储信息。</T>
   //   //
   //   // @param storage 存储信息
   //   // @return 处理结果
   //   //============================================================
   //   boolean deleteFile(SGcStorage storage);
   //
   //   //============================================================
   //   // <T>删除一个存储目录。</T>
   //   //
   //   // @param storage 存储信息
   //   // @return 处理结果
   //   //============================================================
   //   boolean deleteDirectory(SGcStorage storage);
}
