package org.mo.cloud.core.storage;

import org.mo.com.lang.type.TDateTime;

//============================================================
// <T>存储信息。</T>
//============================================================
public class SGcStorage
{
   // 分类
   protected String _catalog;

   // 日期
   protected String _date;

   // 代码
   protected String _code;

   // 版本
   protected String _version;

   // 类型
   protected String _type;

   // 数据
   protected byte[] _data;

   // 来源
   protected String _source;

   // 网络地址
   protected String _uri;

   // 网络地址
   protected String _url;

   //============================================================
   // <T>构造存储信息。</T>
   //============================================================
   public SGcStorage(){
   }

   //============================================================
   // <T>构造存储信息。</T>
   //
   // @param catalog 分类
   // @param type 类型
   // @param code 代码
   // @param name 名称
   // @param source 来源
   //============================================================
   public SGcStorage(String catalog,
                     String date,
                     String code,
                     String version,
                     String type){
      _catalog = catalog;
      _date = date;
      _code = code;
      _version = version;
      _type = type;
   }

   //============================================================
   // <T>构造存储信息。</T>
   //
   // @param catalog 分类
   // @param type 类型
   // @param code 代码
   // @param name 名称
   // @param source 来源
   //============================================================
   public SGcStorage(String catalog,
                     TDateTime date,
                     String code,
                     String version,
                     String type){
      _catalog = catalog;
      _date = date.format("YYYYMMDD");
      _code = code;
      _version = version;
      _type = type;
   }

   //============================================================
   // <T>获得分类。</T>
   //
   // @return 分类
   //============================================================
   public String catalog(){
      return _catalog;
   }

   //============================================================
   // <T>设置分类。</T>
   //
   // @param type 分类
   //============================================================
   public void setCatalog(String catalog){
      _catalog = catalog;
   }

   //============================================================
   // <T>获得日期。</T>
   //
   // @return 日期
   //============================================================
   public String date(){
      return _date;
   }

   //============================================================
   // <T>设置日期。</T>
   //
   // @param type 日期
   //============================================================
   public void setDate(String date){
      _date = date;
   }

   //============================================================
   // <T>获得代码。</T>
   //
   // @return 代码
   //============================================================
   public String code(){
      return _code;
   }

   //============================================================
   // <T>设置代码。</T>
   //
   // @param code 代码
   //============================================================
   public void setCode(String code){
      _code = code;
   }

   //============================================================
   // <T>获得版本。</T>
   //
   // @return 版本
   //============================================================
   public String version(){
      return _version;
   }

   //============================================================
   // <T>设置版本。</T>
   //
   // @param version 版本
   //============================================================
   public void setVersion(String version){
      _version = version;
   }

   //============================================================
   // <T>获得类型。</T>
   //
   // @return 类型
   //============================================================
   public String type(){
      return _type;
   }

   //============================================================
   // <T>设置类型。</T>
   //
   // @param type 类型
   //============================================================
   public void setType(String type){
      _type = type;
   }

   //============================================================
   // <T>获得数据。</T>
   //
   // @return 数据
   //============================================================
   public byte[] data(){
      return _data;
   }

   //============================================================
   // <T>设置数据。</T>
   //
   // @param data 数据
   //============================================================
   public void setData(byte[] data){
      _data = data;
   }

   //============================================================
   // <T>获得来源。</T>
   //
   // @return 来源
   //============================================================
   public String source(){
      return _source;
   }

   //============================================================
   // <T>设置来源。</T>
   //
   // @param source 来源
   //============================================================
   public void setSource(String source){
      _source = source;
   }

   //============================================================
   // <T>获得网络地址。</T>
   //
   // @return 网络地址
   //============================================================
   public String uri(){
      return _uri;
   }

   //============================================================
   // <T>设置网络地址。</T>
   //
   // @param url 网络地址
   //============================================================
   public void setUri(String uri){
      _uri = uri;
   }

   //============================================================
   // <T>获得网络地址。</T>
   //
   // @return 网络地址
   //============================================================
   public String url(){
      return _url;
   }

   //============================================================
   // <T>设置网络地址。</T>
   //
   // @param url 网络地址
   //============================================================
   public void setUrl(String url){
      _url = url;
   }
}
