package org.mo.com.lang;

import org.mo.com.lang.generic.MDoubles;

//============================================================
// <T>双精度浮点数集合。</T>
//============================================================
public class FDoubles
      extends MDoubles
{
   //============================================================
   // <T>构造双精度浮点数集合。</T>
   //============================================================
   public FDoubles(){
   }

   //============================================================
   // <T>构造双精度浮点数集合。</T>
   //
   // @param capacity 容量
   //============================================================
   public FDoubles(int capacity){
      super(capacity);
   }

   //============================================================
   // <T>构造双精度浮点数集合。</T>
   //
   // @param data 数据集合
   //============================================================
   public FDoubles(double[] data){
      append(data);
   }

   //============================================================
   // <T>计算总和。</T>
   //
   // @return 总和
   //============================================================
   public double calculateSum(){
      double total = 0;
      for(int n = 0; n < _length; n++){
         total += _memory[n];
      }
      return total;
   }

   //============================================================
   // <T>计算总和。</T>
   //
   // @return 总和
   //============================================================
   public double calculateSum(int index){
      double total = 0;
      for(int n = 0; n < index; n++){
         total += _memory[n];
      }
      return total;
   }
}
