package org.mo.eng.instantmessag;

import org.mo.com.lang.EResult;

//============================================================
// <T>即时通讯聊天通道接口。</T>
//============================================================
public interface IImChatChannel
      extends
         AutoCloseable
{
   //============================================================
   // <T>发送内容。</T>
   //
   // @param text 内容
   // @return 处理结果
   //============================================================
   EResult send(String text);

   //============================================================
   // <T>发送内容。</T>
   //
   // @param message 消息
   // @return 处理结果
   //============================================================
   EResult send(SImMessage message);
}
