package org.mo.eng.instantmessag;

//============================================================
// <T>账号参数集合。</T>
//============================================================
public class SImAccountParams
{
   // 账号
   protected String _passport;

   // 密码
   protected String _password;

   //============================================================
   // <T>构造账号参数集合。</T>
   //============================================================
   public SImAccountParams(){
   }

   //============================================================
   // <T>构造账号参数集合。</T>
   //
   // @param passport 账号
   // @param password 密码
   //============================================================
   public SImAccountParams(String passport,
                           String password){
      _passport = passport;
      _password = password;
   }

   //============================================================
   // <T>获得账号。</T>
   //
   // @return 账号
   //============================================================
   public String passport(){
      return _passport;
   }

   //============================================================
   // <T>设置账号。</T>
   //
   // @param passport 账号
   //============================================================
   public void setPassport(String passport){
      _passport = passport;
   }

   //============================================================
   // <T>获得密码。</T>
   //
   // @return 密码
   //============================================================
   public String password(){
      return _password;
   }

   //============================================================
   // <T>设置密码。</T>
   //
   // @param password 密码
   //============================================================
   public void setPassword(String password){
      _password = password;
   }
}
