package org.mo.eng.instantmessag;

//============================================================
// <T>登录参数集合。</T>
//============================================================
public class SImLoginParams
{
   // 账号
   protected String _passport;

   // 密码
   protected String _password;

   // 资源
   protected String _resource;

   //============================================================
   // <T>构造登录参数集合。</T>
   //============================================================
   public SImLoginParams(){
   }

   //============================================================
   // <T>获得账号。</T>
   //
   // @return 账号
   //============================================================
   public String passport(){
      return _passport;
   }

   //============================================================
   // <T>设置账号。</T>
   //
   // @param passport 账号
   //============================================================
   public void setPassport(String passport){
      _passport = passport;
   }

   //============================================================
   // <T>获得密码。</T>
   //
   // @return 密码
   //============================================================
   public String password(){
      return _password;
   }

   //============================================================
   // <T>设置密码。</T>
   //
   // @param password 密码
   //============================================================
   public void setPassword(String password){
      _password = password;
   }

   //============================================================
   // <T>获得资源。</T>
   //
   // @return 资源
   //============================================================
   public String resource(){
      return _resource;
   }

   //============================================================
   // <T>设置资源。</T>
   //
   // @param resource 资源
   //============================================================
   public void setResource(String resource){
      _resource = resource;
   }
}
