//============================================================
// <T>用户信息实体定义。</T>
//
// @version 1.0.1
// @auto 代码器管理的代码，如需修改请在手动修改标出的地方修改。
//============================================================
package com.cyou.gccloud.define.entity;

import com.cyou.gccloud.common.INetObject;
import org.mo.com.xml.FXmlNode;

//============================================================
// <T>用户信息实体。</T>
//============================================================
public class SGcUserInfo
      implements
         INetObject
{
   // 实体代码
   public final static String CODE = "";

   // 标签
   protected String _label;

   //============================================================
   // <T>构造实体的实例对象。</T>
   //
   // @return 实例对象
   //============================================================
   public SGcUserInfo(){
   }

   //============================================================
   // <T>获得标签。</T>
   //
   // @return 标签
   //============================================================
   public String label(){
      return _label;
   }

   //============================================================
   // <T>设置标签。</T>
   //
   // @param value 标签
   //============================================================
   public void setLabel(String value){
      _label = value;
   }

   //============================================================
   // <T>接收对象内容。</T>
   //
   // @param value 对象
   //============================================================
   public void assign(Object value){
      SGcUserInfo object = (SGcUserInfo)value;
      _label = object._label;
   }

   //============================================================
   // <T>序列化到输入流中。</T>
   //
   // @param output 输入流
   //============================================================
   public void saveConfig(FXmlNode xconfig){
      xconfig.set("label", _label);
   }

   //============================================================
   // <T>从输出流中反序列化。</T>
   //
   // @param input 输出流
   //============================================================
   public void loadConfig(FXmlNode xconfig){
      _label = xconfig.get("label", null);
   }

   //============================================================
   // <T>重置内容。</T>
   //============================================================
   public void reset(){
      _label = null;
   }
}
